/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sort_partition.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jeongyle <jeongyle@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/12 13:00:49 by jeongyle          #+#    #+#             */
/*   Updated: 2023/01/12 13:23:44 by jeongyle         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "sort.h"
#include "inst_rules.h"

// onethird보다 작으면 b의 tail로
// twothird보다 크면 a의 tail로
// 그 외에는 b의 head로

